      * Widths match src/cpp/layout.h position (24).
      * POS-SHARES is 9(7)V9(4), four implied decimals.
           05 POS-ACCT PIC X(8).
           05 POS-FUND PIC X(5).
           05 POS-SHARES PIC 9(7)V9(4).
