      * Widths match src/cpp/layout.h position value history (41).
      * VALH-SHARES is 9(7)V9(4). VALH-VALUE is cents, 9(9)V99.
           05 VALH-ACCT PIC X(8).
           05 VALH-FUND PIC X(5).
           05 VALH-DATE PIC X(6).
           05 VALH-SHARES PIC 9(7)V9(4).
           05 VALH-VALUE PIC 9(9)V99.
